frontend/modules/v1/models/FUser.php

    public static function isDistributor($user_id){

        $res =  self::find()->where(['user_id' => $user_id])->one();
---
SELECT * FROM `f_user` WHERE `user_id` IS NULL